lucasssvaz/arduino-esp32/libraries/BLE/src/impl/nimble/NimBLEClient.cpp
/*
 * Copyright 2017-2026 Espressif Systems (Shanghai) PTE LTD
 * Copyright 2020-2025 Ryan Powell <ryan@nable-embedded.io> and
 * esp-nimble-cpp, NimBLE-Arduino contributors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "soc/soc_caps.h"
#include "sdkconfig.h"
#if (defined(SOC_BLE_SUPPORTED) || defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)) && defined(CONFIG_NIMBLE_ENABLED)

#include "BLE.h"

#include "NimBLEClient.h"
#include "NimBLERemoteTypes.h"
#include "impl/BLEImplHelpers.h"
#include "esp32-hal-log.h"

#include <host/ble_att.h>
#include <map>

// --------------------------------------------------------------------------
// BLEClient public API
// --------------------------------------------------------------------------

BLEClient::BLEClient() : _impl(nullptr) {}

BLEClient::operator bool() const { return _impl != nullptr; }

BTStatus BLEClient::connect(const BTAddress &address, uint32_t timeoutMs) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  if (impl.connected) return BTStatus::AlreadyConnected;

  impl.peerAddress = address;
  impl.connectSync.take();

  ble_addr_t addr;
  addr.type = static_cast<uint8_t>(address.type());
  memcpy(addr.val, address.data(), 6);

  int rc = ble_gap_connect(BLE_OWN_ADDR_PUBLIC, &addr, timeoutMs, NULL, Impl::gapEventHandler, _impl.get());
  if (rc != 0) {
    impl.connectSync.give(BTStatus::Fail);
    log_e("ble_gap_connect: rc=%d", rc);
    return BTStatus::Fail;
  }

  BTStatus status = impl.connectSync.wait(timeoutMs + 500);
  if (status != BTStatus::OK) {
    ble_gap_conn_cancel();
    return status;
  }

  if (impl.preferredMTU > 0) {
    ble_gattc_exchange_mtu(impl.connHandle, Impl::mtuExchangeCb, _impl.get());
  }

  return BTStatus::OK;
}

BTStatus BLEClient::connect(const BLEAdvertisedDevice &device, uint32_t timeoutMs) {
  if (!device) return BTStatus::InvalidParam;
  return connect(device.getAddress(), timeoutMs);
}

BTStatus BLEClient::connect(const BTAddress &address, BLEPhy phy, uint32_t timeoutMs) {
#if CONFIG_BT_NIMBLE_EXT_ADV
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  if (impl.connected) return BTStatus::AlreadyConnected;

  impl.peerAddress = address;
  impl.connectSync.take();

  ble_addr_t addr;
  addr.type = static_cast<uint8_t>(address.type());
  memcpy(addr.val, address.data(), 6);

  struct ble_gap_ext_conn_params extParams[3] = {};
  uint8_t phyMask = static_cast<uint8_t>(phy);

  for (int i = 0; i < 3; i++) {
    extParams[i].scan_itvl = BLE_GAP_SCAN_FAST_INTERVAL_MIN;
    extParams[i].scan_window = BLE_GAP_SCAN_FAST_WINDOW;
    extParams[i].itvl_min = BLE_GAP_INITIAL_CONN_ITVL_MIN;
    extParams[i].itvl_max = BLE_GAP_INITIAL_CONN_ITVL_MAX;
    extParams[i].latency = 0;
    extParams[i].supervision_timeout = 0x0100;
    extParams[i].min_ce_len = 0;
    extParams[i].max_ce_len = 0;
  }

  int rc = ble_gap_ext_connect(BLE_OWN_ADDR_PUBLIC, &addr, timeoutMs, phyMask, extParams, extParams + 1, extParams + 2,
                               Impl::gapEventHandler, _impl.get());
  if (rc != 0) {
    log_e("ble_gap_ext_connect: rc=%d", rc);
    return BTStatus::Fail;
  }

  BTStatus status = impl.connectSync.wait(timeoutMs + 500);
  if (status != BTStatus::OK) {
    ble_gap_conn_cancel();
    return status;
  }

  if (impl.preferredMTU > 0) {
    ble_gattc_exchange_mtu(impl.connHandle, Impl::mtuExchangeCb, _impl.get());
  }

  return BTStatus::OK;
#else
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEClient::connect(const BLEAdvertisedDevice & /*device*/, BLEPhy /*phy*/, uint32_t /*timeoutMs*/) {
  return BTStatus::NotSupported;
}

BTStatus BLEClient::connectAsync(const BTAddress &address, BLEPhy phy) {
#if CONFIG_BT_NIMBLE_EXT_ADV
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  if (impl.connected) return BTStatus::AlreadyConnected;

  impl.peerAddress = address;

  ble_addr_t addr;
  addr.type = static_cast<uint8_t>(address.type());
  memcpy(addr.val, address.data(), 6);

  struct ble_gap_ext_conn_params extParams[3] = {};
  uint8_t phyMask = static_cast<uint8_t>(phy);

  for (int i = 0; i < 3; i++) {
    extParams[i].scan_itvl = BLE_GAP_SCAN_FAST_INTERVAL_MIN;
    extParams[i].scan_window = BLE_GAP_SCAN_FAST_WINDOW;
    extParams[i].itvl_min = BLE_GAP_INITIAL_CONN_ITVL_MIN;
    extParams[i].itvl_max = BLE_GAP_INITIAL_CONN_ITVL_MAX;
    extParams[i].latency = 0;
    extParams[i].supervision_timeout = 0x0100;
    extParams[i].min_ce_len = 0;
    extParams[i].max_ce_len = 0;
  }

  int rc = ble_gap_ext_connect(BLE_OWN_ADDR_PUBLIC, &addr, 30000, phyMask, extParams, extParams + 1, extParams + 2,
                               Impl::gapEventHandler, _impl.get());
  if (rc != 0) {
    log_e("connectAsync: rc=%d", rc);
    return BTStatus::Fail;
  }
  return BTStatus::OK;
#else
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEClient::connectAsync(const BLEAdvertisedDevice & /*device*/, BLEPhy /*phy*/) {
  return BTStatus::NotSupported;
}

BTStatus BLEClient::cancelConnect() {
  int rc = ble_gap_conn_cancel();
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
}

BTStatus BLEClient::disconnect() {
  if (!_impl || !_impl->connected) return BTStatus::InvalidState;
  int rc = ble_gap_terminate(_impl->connHandle, BLE_ERR_REM_USER_CONN_TERM);
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
}

bool BLEClient::isConnected() const {
  return _impl && _impl->connected;
}

BTStatus BLEClient::secureConnection() {
  if (!_impl || !_impl->connected) return BTStatus::InvalidState;
  int rc = ble_gap_security_initiate(_impl->connHandle);
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
}

// --------------------------------------------------------------------------
// Service discovery
// --------------------------------------------------------------------------

BTStatus BLEClient::discoverServices() {
  if (!_impl || !_impl->connected) return BTStatus::InvalidState;

  _impl->discoveredServices.clear();
  _impl->discoverSync.take();

  int rc = ble_gattc_disc_all_svcs(_impl->connHandle, Impl::serviceDiscoveryCb, _impl.get());
  if (rc != 0) {
    _impl->discoverSync.give(BTStatus::Fail);
    log_e("ble_gattc_disc_all_svcs: rc=%d", rc);
    return BTStatus::Fail;
  }

  BTStatus status = _impl->discoverSync.wait(10000);
  return status;
}

BLERemoteService BLEClient::getService(const BLEUUID &uuid) {
  if (!_impl || !_impl->connected) return BLERemoteService();

  if (_impl->discoveredServices.empty()) {
    if (discoverServices() != BTStatus::OK) return BLERemoteService();
  }

  BLEUUID target = uuid.to128();
  for (auto &entry : _impl->discoveredServices) {
    if (entry.uuid.to128() == target) {
      auto sImpl = std::make_shared<BLERemoteService::Impl>();
      sImpl->uuid = entry.uuid;
      sImpl->startHandle = entry.startHandle;
      sImpl->endHandle = entry.endHandle;
      sImpl->connHandle = _impl->connHandle;
      sImpl->clientImpl = _impl;

      return BLERemoteService(sImpl);
    }
  }
  return BLERemoteService();
}

std::vector<BLERemoteService> BLEClient::getServices() const {
  std::vector<BLERemoteService> result;
  BLE_CHECK_IMPL(result);

  for (auto &entry : impl.discoveredServices) {
    auto sImpl = std::make_shared<BLERemoteService::Impl>();
    sImpl->uuid = entry.uuid;
    sImpl->startHandle = entry.startHandle;
    sImpl->endHandle = entry.endHandle;
    sImpl->connHandle = impl.connHandle;
    sImpl->clientImpl = _impl;

    result.push_back(BLERemoteService(sImpl));
  }
  return result;
}

String BLEClient::getValue(const BLEUUID &serviceUUID, const BLEUUID &charUUID) {
  BLERemoteService svc = getService(serviceUUID);
  if (!svc) return "";
  BLERemoteCharacteristic chr = svc.getCharacteristic(charUUID);
  if (!chr) return "";
  return chr.readValue();
}

BTStatus BLEClient::setValue(const BLEUUID &serviceUUID, const BLEUUID &charUUID, const String &value) {
  BLERemoteService svc = getService(serviceUUID);
  if (!svc) return BTStatus::NotFound;
  BLERemoteCharacteristic chr = svc.getCharacteristic(charUUID);
  if (!chr) return BTStatus::NotFound;
  return chr.writeValue(value);
}

// --------------------------------------------------------------------------
// Callback registration
// --------------------------------------------------------------------------

BTStatus BLEClient::onConnect(ConnectHandler handler) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  std::lock_guard<std::mutex> lock(impl.mtx);
  impl.onConnectCb.set(std::move(handler));
  return BTStatus::OK;
}

BTStatus BLEClient::onDisconnect(DisconnectHandler handler) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  std::lock_guard<std::mutex> lock(impl.mtx);
  impl.onDisconnectCb.set(std::move(handler));
  return BTStatus::OK;
}

BTStatus BLEClient::onConnectFail(ConnectFailHandler handler) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  std::lock_guard<std::mutex> lock(impl.mtx);
  impl.onConnectFailCb.set(std::move(handler));
  return BTStatus::OK;
}

BTStatus BLEClient::onMtuChanged(MtuChangedHandler handler) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  std::lock_guard<std::mutex> lock(impl.mtx);
  impl.onMtuChangedCb.set(std::move(handler));
  return BTStatus::OK;
}

BTStatus BLEClient::onConnParamsUpdateRequest(ConnParamsReqHandler handler) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  std::lock_guard<std::mutex> lock(impl.mtx);
  impl.onConnParamsReqCb = std::move(handler);
  return BTStatus::OK;
}

BTStatus BLEClient::onIdentity(IdentityHandler handler) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  std::lock_guard<std::mutex> lock(impl.mtx);
  impl.onIdentityCb.set(std::move(handler));
  return BTStatus::OK;
}

// --------------------------------------------------------------------------
// Connection info
// --------------------------------------------------------------------------

void BLEClient::setMTU(uint16_t mtu) {
  BLE_CHECK_IMPL();
  impl.preferredMTU = mtu;
  if (impl.connected) {
    ble_gattc_exchange_mtu(impl.connHandle, Impl::mtuExchangeCb, _impl.get());
  }
}

uint16_t BLEClient::getMTU() const {
  if (!_impl || !_impl->connected) return BLE_ATT_MTU_DFLT;
  return ble_att_mtu(_impl->connHandle);
}

int8_t BLEClient::getRSSI() const {
  if (!_impl || !_impl->connected) return -128;
  int8_t rssi;
  int rc = ble_gap_conn_rssi(_impl->connHandle, &rssi);
  return (rc == 0) ? rssi : -128;
}

BTAddress BLEClient::getPeerAddress() const {
  return _impl ? _impl->peerAddress : BTAddress();
}

uint16_t BLEClient::getHandle() const {
  return _impl ? _impl->connHandle : BLE_HS_CONN_HANDLE_NONE;
}

BLEConnInfo BLEClient::getConnection() const {
  if (!_impl || !_impl->connected) return BLEConnInfo();
  struct ble_gap_conn_desc desc;
  int rc = ble_gap_conn_find(_impl->connHandle, &desc);
  if (rc != 0) return BLEConnInfo();
  return BLEConnInfoImpl::fromDesc(desc);
}

BTStatus BLEClient::updateConnParams(const BLEConnParams &params) {
  if (!_impl || !_impl->connected) return BTStatus::InvalidState;
  struct ble_gap_upd_params nimParams = {};
  nimParams.itvl_min = params.minInterval;
  nimParams.itvl_max = params.maxInterval;
  nimParams.latency = params.latency;
  nimParams.supervision_timeout = params.timeout;
  int rc = ble_gap_update_params(_impl->connHandle, &nimParams);
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
}

BTStatus BLEClient::setPhy(BLEPhy txPhy, BLEPhy rxPhy) {
#if defined(SOC_BLE_50_SUPPORTED) || defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  if (!_impl || !_impl->connected) return BTStatus::InvalidState;
  int rc = ble_gap_set_prefered_le_phy(_impl->connHandle, static_cast<uint8_t>(txPhy), static_cast<uint8_t>(rxPhy), 0);
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
#else
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEClient::getPhy(BLEPhy &txPhy, BLEPhy &rxPhy) const {
#if defined(SOC_BLE_50_SUPPORTED) || defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  if (!_impl || !_impl->connected) return BTStatus::InvalidState;
  uint8_t tx, rx;
  int rc = ble_gap_read_le_phy(_impl->connHandle, &tx, &rx);
  if (rc == 0) {
    txPhy = static_cast<BLEPhy>(tx);
    rxPhy = static_cast<BLEPhy>(rx);
    return BTStatus::OK;
  }
  return BTStatus::Fail;
#else
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEClient::setDataLen(uint16_t txOctets, uint16_t txTime) {
  if (!_impl || !_impl->connected) return BTStatus::InvalidState;
  int rc = ble_gap_set_data_len(_impl->connHandle, txOctets, txTime);
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
}

String BLEClient::toString() const {
  BLE_CHECK_IMPL("BLEClient(empty)");
  String s = "BLEClient(peer=";
  s += impl.peerAddress.toString();
  s += impl.connected ? ", connected)" : ", disconnected)";
  return s;
}

// --------------------------------------------------------------------------
// GAP event handler
// --------------------------------------------------------------------------

int BLEClient::Impl::gapEventHandler(struct ble_gap_event *event, void *arg) {
  auto *impl = static_cast<BLEClient::Impl *>(arg);
  if (!impl) return 0;

  switch (event->type) {
    case BLE_GAP_EVENT_CONNECT: {
      if (event->connect.status != 0) {
        log_e("Client connection failed, status=%d", event->connect.status);
        impl->connected = false;
        impl->connHandle = BLE_HS_CONN_HANDLE_NONE;
        impl->connectSync.give(BTStatus::Fail);

        bool hasCb = false;
        {
          std::lock_guard<std::mutex> lock(impl->mtx);
          hasCb = bool(impl->onConnectFailCb);
        }
        if (hasCb) {
          BLEClient clientHandle(std::shared_ptr<BLEClient::Impl>(std::shared_ptr<void>{}, impl));
          impl->onConnectFailCb(clientHandle, event->connect.status);
        }
        return 0;
      }

      impl->connHandle = event->connect.conn_handle;
      impl->connected = true;
      impl->connectSync.give(BTStatus::OK);

      struct ble_gap_conn_desc desc;
      int rc = ble_gap_conn_find(event->connect.conn_handle, &desc);
      if (rc != 0) return 0;

      BLEConnInfo connInfo = BLEConnInfoImpl::fromDesc(desc);

      bool hasCb = false;
      {
        std::lock_guard<std::mutex> lock(impl->mtx);
        hasCb = bool(impl->onConnectCb);
      }
      if (hasCb) {
        BLEClient clientHandle(std::shared_ptr<BLEClient::Impl>(std::shared_ptr<void>{}, impl));
        impl->onConnectCb(clientHandle, connInfo);
      }
      return 0;
    }

    case BLE_GAP_EVENT_DISCONNECT: {
      if (event->disconnect.conn.conn_handle != impl->connHandle) return 0;

      BLEConnInfo connInfo = BLEConnInfoImpl::fromDesc(event->disconnect.conn);
      uint8_t reason = event->disconnect.reason;

      impl->connected = false;
      impl->connHandle = BLE_HS_CONN_HANDLE_NONE;

      bool hasCb = false;
      {
        std::lock_guard<std::mutex> lock(impl->mtx);
        hasCb = bool(impl->onDisconnectCb);
      }
      if (hasCb) {
        BLEClient clientHandle(std::shared_ptr<BLEClient::Impl>(std::shared_ptr<void>{}, impl));
        impl->onDisconnectCb(clientHandle, connInfo, reason);
      }
      return 0;
    }

    case BLE_GAP_EVENT_MTU: {
      if (event->mtu.conn_handle != impl->connHandle) return 0;

      struct ble_gap_conn_desc desc;
      int rc = ble_gap_conn_find(event->mtu.conn_handle, &desc);
      if (rc != 0) return 0;

      BLEConnInfo connInfo = BLEConnInfoImpl::fromDesc(desc);

      bool hasCb = false;
      {
        std::lock_guard<std::mutex> lock(impl->mtx);
        hasCb = bool(impl->onMtuChangedCb);
      }
      if (hasCb) {
        BLEClient clientHandle(std::shared_ptr<BLEClient::Impl>(std::shared_ptr<void>{}, impl));
        impl->onMtuChangedCb(clientHandle, connInfo, event->mtu.value);
      }
      return 0;
    }

    case BLE_GAP_EVENT_CONN_UPDATE_REQ: {
      if (event->conn_update_req.conn_handle != impl->connHandle) return 0;

      if (impl->onConnParamsReqCb) {
        const auto *peer = event->conn_update_req.peer_params;
        BLEConnParams params;
        params.minInterval = peer->itvl_min;
        params.maxInterval = peer->itvl_max;
        params.latency = peer->latency;
        params.timeout = peer->supervision_timeout;

        BLEClient clientHandle(std::shared_ptr<BLEClient::Impl>(std::shared_ptr<void>{}, impl));
        bool accept = impl->onConnParamsReqCb(clientHandle, params);
        if (!accept) {
          return BLE_ERR_CONN_PARMS;
        }
      }
      return 0;
    }

    case BLE_GAP_EVENT_ENC_CHANGE:
    case BLE_GAP_EVENT_IDENTITY_RESOLVED: {
      uint16_t connHandle = (event->type == BLE_GAP_EVENT_ENC_CHANGE)
        ? event->enc_change.conn_handle
        : event->identity_resolved.conn_handle;
      if (connHandle != impl->connHandle) return 0;

      struct ble_gap_conn_desc desc;
      int rc = ble_gap_conn_find(connHandle, &desc);
      if (rc != 0) return 0;

      BLEConnInfo connInfo = BLEConnInfoImpl::fromDesc(desc);

      bool hasCb = false;
      {
        std::lock_guard<std::mutex> lock(impl->mtx);
        hasCb = bool(impl->onIdentityCb);
      }
      if (hasCb) {
        BLEClient clientHandle(std::shared_ptr<BLEClient::Impl>(std::shared_ptr<void>{}, impl));
        impl->onIdentityCb(clientHandle, connInfo);
      }

      if (event->type == BLE_GAP_EVENT_ENC_CHANGE) {
        BLESecurity sec = BLE.getSecurity();
        if (sec) {
          sec.notifyAuthComplete(connInfo, event->enc_change.status == 0);
        }
      }
      return 0;
    }

    case BLE_GAP_EVENT_NOTIFY_RX: {
      BLERemoteCharacteristic::Impl::handleNotifyRx(
        event->notify_rx.conn_handle,
        event->notify_rx.attr_handle,
        event->notify_rx.om,
        event->notify_rx.indication == 0
      );
      return 0;
    }

    case BLE_GAP_EVENT_PASSKEY_ACTION: {
      struct ble_gap_conn_desc desc;
      int rc = ble_gap_conn_find(event->passkey.conn_handle, &desc);
      if (rc != 0) return 0;

      BLEConnInfo connInfo = BLEConnInfoImpl::fromDesc(desc);
      BLESecurity sec = BLE.getSecurity();
      if (!sec) return 0;

      if (event->passkey.params.action == BLE_SM_IOACT_DISP) {
        struct ble_sm_io pkey = {};
        pkey.action = BLE_SM_IOACT_DISP;
        pkey.passkey = sec.resolvePasskeyForDisplay(connInfo);
        ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      } else if (event->passkey.params.action == BLE_SM_IOACT_INPUT) {
        struct ble_sm_io pkey = {};
        pkey.action = BLE_SM_IOACT_INPUT;
        pkey.passkey = sec.resolvePasskeyForInput(connInfo);
        ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      } else if (event->passkey.params.action == BLE_SM_IOACT_NUMCMP) {
        struct ble_sm_io pkey = {};
        pkey.action = BLE_SM_IOACT_NUMCMP;
        pkey.numcmp_accept = sec.resolveNumericComparison(connInfo, event->passkey.params.numcmp) ? 1 : 0;
        ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      }
      return 0;
    }

    default: return 0;
  }
}

// --------------------------------------------------------------------------
// Service discovery callback
// --------------------------------------------------------------------------

int BLEClient::Impl::serviceDiscoveryCb(uint16_t connHandle, const struct ble_gatt_error *error,
                                         const struct ble_gatt_svc *service, void *arg) {
  auto *impl = static_cast<BLEClient::Impl *>(arg);
  if (!impl) return 0;

  if (error->status == 0 && service != nullptr) {
    RemoteServiceEntry entry;
    if (service->uuid.u.type == BLE_UUID_TYPE_16) {
      entry.uuid = BLEUUID(static_cast<uint16_t>(BLE_UUID16(&service->uuid.u)->value));
    } else if (service->uuid.u.type == BLE_UUID_TYPE_32) {
      entry.uuid = BLEUUID(static_cast<uint32_t>(BLE_UUID32(&service->uuid.u)->value));
    } else {
      entry.uuid = BLEUUID(BLE_UUID128(&service->uuid.u)->value, 16, true);
    }
    entry.startHandle = service->start_handle;
    entry.endHandle = service->end_handle;
    impl->discoveredServices.push_back(entry);
    return 0;
  }

  if (error->status == BLE_HS_EDONE) {
    impl->discoverSync.give(BTStatus::OK);
  } else {
    impl->discoverSync.give(BTStatus::Fail);
  }
  return 0;
}

// --------------------------------------------------------------------------
// MTU exchange callback
// --------------------------------------------------------------------------

int BLEClient::Impl::mtuExchangeCb(uint16_t connHandle, const struct ble_gatt_error *error, uint16_t mtu, void *arg) {
  if (error->status == 0) {
    log_i("MTU exchange complete: %d", mtu);
  } else {
    log_w("MTU exchange failed, status=%d", error->status);
  }
  return 0;
}

// --------------------------------------------------------------------------
// BLEClass::createClient() -- NimBLE factory method
// --------------------------------------------------------------------------

BLEClient BLEClass::createClient() {
  if (!isInitialized()) {
    return BLEClient();
  }

  return BLEClient(std::make_shared<BLEClient::Impl>());
}

#endif /* (SOC_BLE_SUPPORTED || CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE) && CONFIG_NIMBLE_ENABLED */
